Revit 2024 API
GroupTypeId.MechanicalLoads Property
 Mechanical - Loads.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId MechanicalLoads { get; }
Visual Basic
Public Shared ReadOnly Property MechanicalLoads As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ MechanicalLoads {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace